# IsDXFExportAvailable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsDXFExportAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the DXF Export functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsDXFExportAvailable()
```

Visual Basic
---
```text
Public Shared Function IsDXFExportAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsDXFExportAvailable()
```

# ### Return Value
True if the DXF Export functionality is available in the installed Revit.
# Remarks
DXF Export requires presence of certain modules that are optional and may not be part of the installed Revit.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace